<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Historia de las aplicaciones web, sus orígenes, evolución y el impacto actual.">
<meta name="keywords" content="Historia, Web, Aplicaciones, Evolución">
<title>Historia de Aplicaciones Web</title>
<style>
body { font-family: Arial, sans-serif; margin: 20px; }
nav a { margin-right: 15px; text-decoration: none; color: #2980B9; }
section { margin-bottom: 40px; }
</style>
</head>
<body>
<nav>
<a href="index.html">Inicio</a>
<a href="historia.html">Historia Web</a>
<a href="practica1.html">CV</a>
</nav>
<header>
<h1>Historia de Aplicaciones Web</h1>
<p>Explora los hitos históricos de la web.</p>
</header>
<section id="origenes">
<h2>Orígenes</h2>

<h1>Historia de las Aplicaciones Web</h1>
<p>Las aplicaciones web han evolucionado significativamente desde la creaci&oacute;n de la World Wide Web en 1989 por Tim Berners-Lee. Inicialmente, las páginas web eran est&aacute;ticas y consist&iacute;an principalmente en texto e im&aacute;genes b&aacute;sicas. Estas primeras p&aacute;ginas web estaban escritas en HTML y no ten&iacute;an funcionalidades interactivas.</p>

<h2>D&eacute;cada de 1990</h2>
<p>En la d&eacute;cada de 1990, con el desarrollo de lenguajes de scripting como JavaScript y tecnolog&iacute;as como CSS (Cascading Style Sheets), las p&aacute;ginas web comenzaron a volverse más interactivas y visualmente atractivas. La incorporaci&oacute;n de JavaScript permiti&oacute; a los desarrolladores agregar elementos interactivos, como formularios din&aacute;micos, validaciones de datos y efectos visuales.</p>
<p>Adem&aacute;s, en esta d&eacute;cada surgieron los primeros navegadores web populares, como Netscape Navigator e Internet Explorer, lo que contribuy&oacute; a la adopci&oacute;n masiva de la web. Tambi&eacute;n aparecieron las primeras aplicaciones web empresariales, aunque eran limitadas en comparaci&oacute;n con las aplicaciones actuales.</p>
<a href="#evolucion">Siguiente: Evoluci&oacute;n</a>

<h2>Año 2000</h2>
<p>En el año 2000, con la aparici&oacute;n de tecnolog&iacute;as como AJAX (Asynchronous JavaScript and XML), las aplicaciones web se volvieron a&uacute;n m&aacute;s din&aacute;micas, permitiendo la actualizaci&oacute;n de contenido sin necesidad de recargar toda la p&aacute;gina. Esto mejor&oacute; significativamente la experiencia del usuario, haciendo las aplicaciones web m&aacute;s r&aacute;pidas y receptivas.</p>
<p>Durante esta &eacute;poca, comenzaron a surgir las primeras aplicaciones web colaborativas, como wikis y blogs, que permit&iacute;an a los usuarios crear y compartir contenido de manera sencilla. Tambi&eacute;n se popularizaron las plataformas de comercio electr&oacute;nico, como Amazon y eBay, que revolucionaron la forma en que las personas compraban y vend&iacute;an productos en línea.</p>

<h2>La &Uacute;ltima Década</h2>
<p>En la &uacute;ltima d&eacute;cada, con el auge de las APIs y los frameworks de JavaScript como React, Angular y Vue, las aplicaciones web han alcanzado un nuevo nivel de complejidad y funcionalidad. Estos frameworks permiten a los desarrolladores crear aplicaciones web de una sola p&aacute;gina (SPA) que ofrecen una experiencia de usuario fluida y sin interrupciones.</p>
<p>Adem&aacute;s, la adopci&oacute;n de tecnolog&iacute;as de la nube ha permitido a las aplicaciones web escalar de manera eficiente y gestionar grandes volúmenes de datos. Plataformas como AWS (Amazon Web Services) y Azure han facilitado el despliegue y la gesti&oacute;n de aplicaciones web a nivel global.</p>
<p>En la actualidad, las aplicaciones web rivalizan en muchos aspectos con las aplicaciones de escritorio tradicionales y se utilizan en una amplia variedad de sectores, desde la educaci&oacute;n y la salud hasta el entretenimiento y la productividad.</p>

<h2>El Futuro</h2>
<p>El futuro de las aplicaciones web es prometedor, con avances en tecnologías emergentes como la inteligencia artificial, la realidad aumentada y la realidad virtual. Estas tecnolog&iacute;as est&aacute;n empezando a integrarse en las aplicaciones web, ofreciendo experiencias m&aacute;s inmersivas y personalizadas para los usuarios.</p>
<p>A medida que la conectividad y las capacidades de los dispositivos contin&uacute;an mejorando, es probable que veamos un aumento en la adopci&oacute;n de aplicaciones web progresivas (PWA), que combinan lo mejor de las aplicaciones web y móviles. Las PWA pueden funcionar sin conexi&oacute;n, enviar notificaciones push y ofrecer un rendimiento similar al de las aplicaciones nativas.</p>
</section>
<section id="evolucion">